Tekla.Structures.ModelInternal.Operation.GetExternalReferenceModelComparisonSets
Gets the available comparison sets titles.
Returns: The titles of the available comparsion sets.

Tekla.Structures.ModelInternal.Operation.ExportIFCFromFilteredObjects(System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportViewTypeEnum,System.Collections.Generic.List{System.String},System.String,Tekla.Structures.ModelInternal.Operation.ExportBasePoint,System.String,System.String,Tekla.Structures.ModelInternal.Operation.IFCExportFlags,System.Boolean,System.Boolean,System.String)
IFC export from filtered objects
ModelName:  The name of the model in the export file.
FullFileName:  The name of the export file with file path.
ViewType:  Configuration view type of the export.
PropertySets:  List of property sets to be exported.
FilterName:  Filter file name for model objects to export.
BasePoint: Defines which base point is used in export.
ExportLayersAs: Defines which report field to use for layers export.
ObjectColoring: Defines which object coloring filter is to be used in export.
Flags: Boolean flags for IFC 4 export.
UseTimer:  Export with timer information.
CreateReport:  Create report from export.
BasePointGuid: Base point guid if BasePoint parameter is set to BASE_POINT.
Returns:
Returns false if the export fails for some reason

Tekla.Structures.ModelInternal.Operation.ReferenceModel_GetRotataion3D(Tekla.Structures.Model.ReferenceModel)
Gets 3d rotation for reference model.
rm: The reference model object.
Returns: The 3d rotation.

Tekla.Structures.ModelInternal.Operation.ReferenceModel_SetUseWorkplane(Tekla.Structures.Model.ReferenceModel,System.Boolean)
Sets use workplane flag for reference model.
rm: The reference model object.
useWorkplane: The new use workplane flag.

Tekla.Structures.ModelInternal.Operation.AppendShapeMetadata(System.String,System.Collections.Generic.List{System.String})
Append the metadata defined in keyValStrings to shape indentified by guid
guid: The guid of the shape
keyValStrings: The key value pairs of strings that contain the metadata
Returns: True if the appending operation was successful

Tekla.Structures.ModelInternal.Operation.GetShapeMetadata(System.String)
Get metadata from the shape catalog for a shape specified by its GUID
guid: The guid of the shape
Returns: List of tuples that contain key and value pairs containing the metadata